nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/gcc/startup_MIMXRT735S_cm33_core0.S
/* ------------------------------------------------------------------------- */
/*  @file:    startup_MIMXRT735S_cm33_core0.s                                */
/*  @purpose: CMSIS Cortex-M33 Core Device Startup File                      */
/*            MIMXRT735S_cm33_core0                                          */
/*  @version: 2.0                                                            */
/*  @date:    2024-5-28                                                      */
/*  @build:   b240626                                                        */
/* ------------------------------------------------------------------------- */
/*                                                                           */
/* Copyright 1997-2016 Freescale Semiconductor, Inc.                         */
/* Copyright 2016-2024 NXP                                                   */
/* SPDX-License-Identifier: BSD-3-Clause                                     */
/*****************************************************************************/
/* Version: GCC for ARM Embedded Processors                                  */
/*****************************************************************************/
    .syntax unified
    .arch armv8-m.main

    .section .isr_vector, "a"
    .align 2
    .globl __isr_vector
__isr_vector:
    .long   __StackTop                                      /* Top of Stack */
    .long   Reset_Handler                                   /* Reset Handler */
    .long   NMI_Handler                                     /* NMI Handler*/
    .long   HardFault_Handler                               /* Hard Fault Handler*/
    .long   MemManage_Handler                               /* MPU Fault Handler*/
    .long   BusFault_Handler                                /* Bus Fault Handler*/
    .long   UsageFault_Handler                              /* Usage Fault Handler*/
    .long   SecureFault_Handler                             /* Secure Fault Handler*/
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
    .long   0x180000                                        /* Image length*/
#else
    .long   _image_size                                     /* Image length*/
#endif
    .long   0                                               /* Reserved*/
    .long   0                                               /* Reserved*/
    .long   SVC_Handler                                     /* SVCall Handler*/
    .long   DebugMon_Handler                                /* Debug Monitor Handler*/
    .long   __isr_vector                                    /* Image load address*/
    .long   PendSV_Handler                                  /* PendSV Handler*/
    .long   SysTick_Handler                                 /* SysTick Handler*/

                                                            /* External Interrupts*/
    .long   Reserved16_IRQHandler                           /* Reserved interrupt 16*/
    .long   UTICK0_IRQHandler                               /* Micro-tick Timer*/
    .long   MRT0_IRQHandler                                 /* MRT: Ored Interrupt request*/
    .long   CTIMER0_IRQHandler                              /* CTIMER: Interrupt request*/
    .long   CTIMER1_IRQHandler                              /* CTIMER: Interrupt request*/
    .long   SCT0_IRQHandler                                 /* SCT: Interrupt request*/
    .long   CTIMER3_IRQHandler                              /* CTIMER: Interrupt request*/
    .long   LP_FLEXCOMM0_IRQHandler                         /* FLEXCOMM: Interrupt request*/
    .long   LP_FLEXCOMM1_IRQHandler                         /* FLEXCOMM: Interrupt request*/
    .long   LP_FLEXCOMM2_IRQHandler                         /* FLEXCOMM: Interrupt request*/
    .long   LP_FLEXCOMM3_IRQHandler                         /* FLEXCOMM: Interrupt request*/
    .long   LP_FLEXCOMM4_IRQHandler                         /* FLEXCOMM: Interrupt request*/
    .long   LP_FLEXCOMM5_IRQHandler                         /* FLEXCOMM: Interrupt request*/
    .long   LPSPI14_IRQHandler                              /* LPSPI: Interrupt request*/
    .long   LPI2C15_IRQHandler                              /* LPI2C: Interrupt request*/
    .long   ADC_IRQHandler                                  /* ADC0: Interrupt request*/
    .long   SDADC_IRQHandler                                /* SDADC0: Interrupt request*/
    .long   ACMP_IRQHandler                                 /* ACMP: interrupt request*/
    .long   PDM_EVENT_IRQHandler                            /* MIC: Interrupt request for read data or Error*/
    .long   PDM_HWVAD_EVENT_IRQHandler                      /* MIC: Hardware Voice Activity Detector interrupt or error interrupt*/
    .long   HYPERVISOR_IRQHandler                           /* SECURE: Compute domain P-Bus Hypervisor interrupt*/
    .long   SECURE_VIOLATION_IRQHandler                     /* SECURE: Compute domain P-Bus Secure violation interrupt*/
    .long   SENSE_HYPERVISOR_IRQHandler                     /* Sense domain Hypervisor interrupt*/
    .long   SENSE_SECURE_VIOLATION_IRQHandler               /* Sense domain Secure violation interrupt*/
    .long   MEDIA_HYPERVISOR_IRQHandler                     /* Media domain Hypervisor interrupt*/
    .long   MEDIA_SECURE_VIOLATION_IRQHandler               /* Media domain Secure violation interrupt*/
    .long   RTC0_ALARM_IRQHandler                           /* RTC: Alarm interrupt*/
    .long   RTC0_IRQHandler                                 /* RTC: wakeup interrupt to Compute domain*/
    .long   Reserved44_IRQHandler                           /* Reserved interrupt*/
    .long   MU0_A_IRQHandler                                /* MU0: MUA, CPU0 to HiFi1*/
    .long   MU1_A_IRQHandler                                /* MU1: MUA, CPU0 to CPU1*/
    .long   Reserved47_IRQHandler                           /* Reserved interrupt*/
    .long   CTIMER2_IRQHandler                              /* CTIMER: Interrupt request*/
    .long   CTIMER4_IRQHandler                              /* CTIMER: Interrupt request*/
    .long   OS_EVENT_IRQHandler                             /* OSEVENT: Event timer CPU0 Wakeup/interrupt*/
    .long   LP_FLEXCOMM6_IRQHandler                         /* FLEXCOMM: Interrupt request*/
    .long   LP_FLEXCOMM7_IRQHandler                         /* FLEXCOMM: Interrupt request*/
    .long   USDHC0_IRQHandler                               /* USDHC: Interrupt request*/
    .long   USDHC1_IRQHandler                               /* USDHC: Interrupt request*/
    .long   I3C0_IRQHandler                                 /* I3C: Interrupt Request*/
    .long   USB0_IRQHandler                                 /* USB: HSUSB Interrup request*/
    .long   USB1_IRQHandler                                 /* USB: eUSB Interrup request*/
    .long   WDT0_IRQHandler                                 /* WDT: Interrupt request*/
    .long   WDT1_IRQHandler                                 /* WDT: Interrupt request*/
    .long   USBPHY0_IRQHandler                              /* HSUSBPHY: UTM interrupt request*/
    .long   PUF_IRQHandler                                  /* PUF: Interrupt Request*/
    .long   PMIC_IRQN_IRQHandler                            /* PMIC: External PMIC interrupt*/
    .long   LP_FLEXCOMM8_IRQHandler                         /* FLEXCOMM: Interrupt request*/
    .long   LP_FLEXCOMM9_IRQHandler                         /* FLEXCOMM: Interrupt request*/
    .long   LP_FLEXCOMM10_IRQHandler                        /* FLEXCOMM: Interrupt request*/
    .long   LP_FLEXCOMM11_IRQHandler                        /* FLEXCOMM: Interrupt request*/
    .long   LP_FLEXCOMM12_IRQHandler                        /* FLEXCOMM: Interrupt request*/
    .long   LP_FLEXCOMM13_IRQHandler                        /* FLEXCOMM: Interrupt request*/
    .long   LPSPI16_IRQHandler                              /* LPSPI: Interrupt request*/
    .long   I3C1_IRQHandler                                 /* I3C: Interrupt Request*/
    .long   FLEXIO_IRQHandler                               /* FLEXIO: Interrupt request*/
    .long   Reserved72_IRQHandler                           /* Reserved interrupt*/
    .long   Reserved73_IRQHandler                           /* Reserved interrupt*/
    .long   Reserved74_IRQHandler                           /* Reserved interrupt*/
    .long   EDMA0_CH0_IRQHandler                            /* EDMA: Channel 0 interrupt*/
    .long   EDMA0_CH1_IRQHandler                            /* EDMA: Channel 1 interrupt*/
    .long   EDMA0_CH2_IRQHandler                            /* EDMA: Channel 2 interrupt*/
    .long   EDMA0_CH3_IRQHandler                            /* EDMA: Channel 3 interrupt*/
    .long   EDMA0_CH4_IRQHandler                            /* EDMA: Channel 4 interrupt*/
    .long   EDMA0_CH5_IRQHandler                            /* EDMA: Channel 5 interrupt*/
    .long   EDMA0_CH6_IRQHandler                            /* EDMA: Channel 6 interrupt*/
    .long   EDMA0_CH7_IRQHandler                            /* EDMA: Channel 7 interrupt*/
    .long   EDMA0_CH8_IRQHandler                            /* EDMA: Channel 8 interrupt*/
    .long   EDMA0_CH9_IRQHandler                            /* EDMA: Channel 9 interrupt*/
    .long   EDMA0_CH10_IRQHandler                           /* EDMA: Channel 10 interrupt*/
    .long   EDMA0_CH11_IRQHandler                           /* EDMA: Channel 11 interrupt*/
    .long   EDMA0_CH12_IRQHandler                           /* EDMA: Channel 12 interrupt*/
    .long   EDMA0_CH13_IRQHandler                           /* EDMA: Channel 13 interrupt*/
    .long   EDMA0_CH14_IRQHandler                           /* EDMA: Channel 14 interrupt*/
    .long   EDMA0_CH15_IRQHandler                           /* EDMA: Channel 15 interrupt*/
    .long   EDMA1_CH0_IRQHandler                            /* EDMA: Channel 0 interrupt*/
    .long   EDMA1_CH1_IRQHandler                            /* EDMA: Channel 1 interrupt*/
    .long   EDMA1_CH2_IRQHandler                            /* EDMA: Channel 2 interrupt*/
    .long   EDMA1_CH3_IRQHandler                            /* EDMA: Channel 3 interrupt*/
    .long   EDMA1_CH4_IRQHandler                            /* EDMA: Channel 4 interrupt*/
    .long   EDMA1_CH5_IRQHandler                            /* EDMA: Channel 5 interrupt*/
    .long   EDMA1_CH6_IRQHandler                            /* EDMA: Channel 6 interrupt*/
    .long   EDMA1_CH7_IRQHandler                            /* EDMA: Channel 7 interrupt*/
    .long   EDMA1_CH8_IRQHandler                            /* EDMA: Channel 8 interrupt*/
    .long   EDMA1_CH9_IRQHandler                            /* EDMA: Channel 9 interrupt*/
    .long   EDMA1_CH10_IRQHandler                           /* EDMA: Channel 10 interrupt*/
    .long   EDMA1_CH11_IRQHandler                           /* EDMA: Channel 11 interrupt*/
    .long   EDMA1_CH12_IRQHandler                           /* EDMA: Channel 12 interrupt*/
    .long   EDMA1_CH13_IRQHandler                           /* EDMA: Channel 13 interrupt*/
    .long   EDMA1_CH14_IRQHandler                           /* EDMA: Channel 14 interrupt*/
    .long   EDMA1_CH15_IRQHandler                           /* EDMA: Channel 15 interrupt*/
    .long   GPIO00_IRQHandler                               /* GPIO: Interupt request, channel 0*/
    .long   GPIO01_IRQHandler                               /* GPIO: Interupt request, channel 1*/
    .long   GPIO10_IRQHandler                               /* GPIO: Interupt request, channel 0*/
    .long   GPIO11_IRQHandler                               /* GPIO: Interupt request, channel 1*/
    .long   GPIO20_IRQHandler                               /* GPIO: Interupt request, channel 0*/
    .long   GPIO21_IRQHandler                               /* GPIO: Interupt request, channel 1*/
    .long   GPIO30_IRQHandler                               /* GPIO: Interupt request, channel 0*/
    .long   GPIO31_IRQHandler                               /* GPIO: Interupt request, channel 1*/
    .long   GPIO40_IRQHandler                               /* GPIO: Interupt request, channel 0*/
    .long   GPIO41_IRQHandler                               /* GPIO: Interupt request, channel 1*/
    .long   GPIO50_IRQHandler                               /* GPIO: Interupt request, channel 0*/
    .long   GPIO51_IRQHandler                               /* GPIO: Interupt request, channel 1*/
    .long   GPIO60_IRQHandler                               /* GPIO: Interupt request, channel 0*/
    .long   GPIO61_IRQHandler                               /* GPIO: Interupt request, channel 1*/
    .long   GPIO70_IRQHandler                               /* GPIO: Interupt request, channel 0*/
    .long   GPIO71_IRQHandler                               /* GPIO: Interupt request, channel 1*/
    .long   PIN_INT0_IRQHandler                             /* PINT: Interupt request 0*/
    .long   PIN_INT1_IRQHandler                             /* PINT: Interupt request 1*/
    .long   PIN_INT2_IRQHandler                             /* PINT: Interupt request 2*/
    .long   PIN_INT3_IRQHandler                             /* PINT: Interupt request 3*/
    .long   PIN_INT4_IRQHandler                             /* PINT: Interupt request 4*/
    .long   PIN_INT5_IRQHandler                             /* PINT: Interupt request 5*/
    .long   PIN_INT6_IRQHandler                             /* PINT: Interupt request 6*/
    .long   PIN_INT7_IRQHandler                             /* PINT: Interupt request 7*/
    .long   SAI0_IRQHandler                                 /* SAI: TX/RX interrupt*/
    .long   SAI1_IRQHandler                                 /* SAI: TX/RX interrupt*/
    .long   SAI2_IRQHandler                                 /* SAI: TX/RX interrupt*/
    .long   XSPI0_IRQHandler                                /* xSPI: Ored interrupt*/
    .long   XSPI1_IRQHandler                                /* xSPI: Ored interrupt*/
    .long   XSPI2_IRQHandler                                /* xSPI: Ored interrupt*/
    .long   MMU0_IRQHandler                                 /* MMU: Interrupt request*/
    .long   MMU1_IRQHandler                                 /* MMU: Interrupt request*/
    .long   MMU2_IRQHandler                                 /* MMU: Interrupt request*/
    .long   Freqme_IRQHandler                               /* FREQME: Interrupt request*/
    .long   GDET0_IRQHandler                                /* GDET: Interrupt request*/
    .long   GDET1_IRQHandler                                /* GDET: Interrupt request*/
    .long   GDET2_IRQHandler                                /* GDET: Interrupt request*/
    .long   GDET3_IRQHandler                                /* GDET: Interrupt request*/
    .long   CDOG0_IRQHandler                                /* CDOG: Interrupt request*/
    .long   CDOG1_IRQHandler                                /* CDOG: Interrupt request*/
    .long   CDOG2_IRQHandler                                /* CDOG: Interrupt request*/
    .long   ITRC0_IRQHandler                                /* ITRC: Interrupt, cleared by software*/
    .long   ELS_IRQHandler                                  /* ELS Interrupt request*/
    .long   PKC_IRQHandler                                  /* PKC: Public Key Cryptography Interrutp*/
    .long   OSCCA_IRQHandler                                /* OSCCA: OSCCA Interrupt request*/
    .long   SLEEPCON0_IRQHandler                            /* WAKEUP: CPU0 wakeup event*/
    .long   CPU0_IRQHandler                                 /* CTI0: interrupt request*/
    .long   PMC_IRQHandler                                  /* PMC: Compute domain Interrupt*/
    .long   Reserved155_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved156_IRQHandler                          /* Reserved interrupt*/
    .long   NPU_IRQHandler                                  /* NPU: Interrupt request*/
    .long   TRNG_IRQHandler                                 /* TRNG: interrupt*/
    .long   TEMPDET0_IRQHandler                             /* TEMPDET0: Interrupt request 0*/
    .long   TEMPDET1_IRQHandler                             /* TEMPDET1: Interrupt request 1*/
    .long   EZHV_IRQHandler                                 /* EZH-V: Interrupt request*/
    .long   GLIKEY0_IRQHandler                              /* GLIKEY: Interrupt*/
    .long   GLIKEY2_IRQHandler                              /* GLIKEY: Interrupt*/
    .long   GLIKEY3_IRQHandler                              /* GLIKEY: Interrupt*/
    .long   GLIKEY5_IRQHandler                              /* GLIKEY: Interrupt*/
    .long   PVTS0_CPU0_IRQHandler                           /* PVTS0 CPU0 interrupt*/
    .long   Reserved167_IRQHandler                          /* Reserved interrupt 167*/
    .long   PVTS0_HIFI4_IRQHandler                          /* PVTS0 HIFI4 interrupt*/
    .long   Reserved169_IRQHandler                          /* Reserved interrupt 169*/
    .long   FRO0_IRQHandler                                 /* FRO: 300MHz FRO in VDD2 domain Async interrupt*/
    .long   FRO1_IRQHandler                                 /* FRO: 192MHz FRO in VDD2 domain Async interrupt*/
    .long   FRO2_IRQHandler                                 /* FRO: 300MHz FRO in VDD1 domain Async interrupt*/
    .long   OCOTP_IRQHandler                                /* OCOTP warning and integrity error interrupt*/

    .size   __isr_vector, . - __isr_vector

    .text
    .thumb

