nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/gcc/startup_MIMXRT735S_cm33_core0.S
#if defined (__cplusplus)
#ifdef __REDLIB__
#error Redlib does not support C++
#endif
#endif
/* Reset Handler */

    .thumb_func
    .align 2
    .globl   Reset_Handler
    .weak    Reset_Handler
    .type    Reset_Handler, %function
Reset_Handler:
    cpsid   i               /* Mask interrupts */
    .equ    VTOR, 0xE000ED08
    ldr     r0, =VTOR
    ldr     r1, =__isr_vector
    str     r1, [r0]
    ldr     r2, [r1]
    msr     msp, r2
    ldr     r0, =__StackLimit
    msr     msplim, r0
#ifndef __NO_SYSTEM_INIT
    ldr   r0,=SystemInit
    blx   r0
#endif
/*     Loop to copy data from read only memory to RAM. The ranges
 *      of copy from/to are specified by following symbols evaluated in
 *      linker script.
 *      __etext: End of code section, i.e., begin of data sections to copy from.
 *      __data_start__/__data_end__: RAM address range that data should be
 *      __noncachedata_start__/__noncachedata_end__ : none cachable region
 *      copied to. Both must be aligned to 4 bytes boundary.  */

    ldr    r1, =__etext
    ldr    r2, =__data_start__
    ldr    r3, =__data_end__

#if 1
/* Here are two copies of loop implemenations. First one favors code size
 * and the second one favors performance. Default uses the first one.
 * Change to "#if 0" to use the second one */
.LC0:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC0
#else
    subs    r3, r2
    ble    .LC1
.LC0:
    subs    r3, #4
    ldr    r0, [r1, r3]
    str    r0, [r2, r3]
    bgt    .LC0
.LC1:
#endif

#ifdef __STARTUP_INITIALIZE_NONCACHEDATA
    ldr    r2, =__noncachedata_start__
    ldr    r3, =__noncachedata_init_end__
#ifdef __PERFORMANCE_IMPLEMENTATION
/* Here are two copies of loop implementations. First one favors performance
 * and the second one favors code size. Default uses the second one.
 * Define macro "__PERFORMANCE_IMPLEMENTATION" in project to use the first one */
    subs    r3, r2
    ble    .LC6
.LC5:
    subs    r3, #4
    ldr    r0, [r1, r3]
    str    r0, [r2, r3]
    bgt    .LC5
.LC6:
#else  /* code size implemenation */
.LC5:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC5
#endif
/* zero inited ncache section initialization */
    ldr r3, =__noncachedata_end__
    movs    r0,0
.LC7:
    cmp    r2,r3
    itt    lt
    strlt   r0,[r2],#4
    blt    .LC7
#endif /* __STARTUP_INITIALIZE_NONCACHEDATA */

#ifdef __STARTUP_CLEAR_BSS
/*     This part of work usually is done in C library startup code. Otherwise,
 *     define this macro to enable it in this startup.
 *
 *     Loop to zero out BSS section, which uses following symbols
 *     in linker script:
 *      __bss_start__: start of BSS section. Must align to 4
 *      __bss_end__: end of BSS section. Must align to 4
 */
    ldr r1, =__bss_start__
    ldr r2, =__bss_end__

    movs    r0, 0
.LC2:
    cmp     r1, r2
    itt    lt
    strlt   r0, [r1], #4
    blt    .LC2
#endif /* __STARTUP_CLEAR_BSS */

/* Add stack / heap initializaiton */
    movs    r0, 0
    ldr     r1, =__HeapBase
    ldr     r2, =__HeapLimit
.LC3:
    cmp     r1, r2
    itt     lt
    strlt   r0, [r1], #4
    blt     .LC3

    ldr     r1, =__StackLimit
    ldr     r2, =__StackTop
.LC4:
    cmp     r1, r2
    itt     lt
    strlt   r0, [r1], #4
    blt     .LC4

/*End of stack / heap initializaiton */
    cpsie   i               /* Unmask interrupts */
#ifndef __START
#ifdef __REDLIB__
#define __START __main
#else
#define __START _start
#endif
#endif
#ifndef __ATOLLIC__
    ldr   r0,=__START
    blx   r0
#else
    ldr   r0,=__libc_init_array
    blx   r0
    ldr   r0,=main
    bx    r0
#endif
    .pool
    .size Reset_Handler, . - Reset_Handler

    .align  1
    .thumb_func
    .weak DefaultISR
    .type DefaultISR, %function
DefaultISR:
    b DefaultISR
    .size DefaultISR, . - DefaultISR

    .align 1
    .thumb_func
    .weak NMI_Handler
    .type NMI_Handler, %function
NMI_Handler:
    ldr   r0,=NMI_Handler
    bx    r0
    .size NMI_Handler, . - NMI_Handler

    .align 1
    .thumb_func
    .weak HardFault_Handler
    .type HardFault_Handler, %function
HardFault_Handler:
    ldr   r0,=HardFault_Handler
    bx    r0
    .size HardFault_Handler, . - HardFault_Handler

    .align 1
    .thumb_func
    .weak SVC_Handler
    .type SVC_Handler, %function
SVC_Handler:
    ldr   r0,=SVC_Handler
    bx    r0
    .size SVC_Handler, . - SVC_Handler

    .align 1
    .thumb_func
    .weak PendSV_Handler
    .type PendSV_Handler, %function
PendSV_Handler:
    ldr   r0,=PendSV_Handler
    bx    r0
    .size PendSV_Handler, . - PendSV_Handler

    .align 1
    .thumb_func
    .weak SysTick_Handler
    .type SysTick_Handler, %function
SysTick_Handler:
    ldr   r0,=SysTick_Handler
    bx    r0
    .size SysTick_Handler, . - SysTick_Handler

    .align 1
    .thumb_func
    .weak Reserved16_IRQHandler
    .type Reserved16_IRQHandler, %function
Reserved16_IRQHandler:
    ldr   r0,=Reserved16_DriverIRQHandler
    bx    r0
    .size Reserved16_IRQHandler, . - Reserved16_IRQHandler

    .align 1
    .thumb_func
    .weak UTICK0_IRQHandler
    .type UTICK0_IRQHandler, %function
UTICK0_IRQHandler:
    ldr   r0,=UTICK0_DriverIRQHandler
    bx    r0
    .size UTICK0_IRQHandler, . - UTICK0_IRQHandler

    .align 1
    .thumb_func
    .weak MRT0_IRQHandler
    .type MRT0_IRQHandler, %function
MRT0_IRQHandler:
    ldr   r0,=MRT0_DriverIRQHandler
    bx    r0
    .size MRT0_IRQHandler, . - MRT0_IRQHandler

    .align 1
    .thumb_func
    .weak CTIMER0_IRQHandler
    .type CTIMER0_IRQHandler, %function
CTIMER0_IRQHandler:
    ldr   r0,=CTIMER0_DriverIRQHandler
    bx    r0
    .size CTIMER0_IRQHandler, . - CTIMER0_IRQHandler

    .align 1
    .thumb_func
    .weak CTIMER1_IRQHandler
    .type CTIMER1_IRQHandler, %function
CTIMER1_IRQHandler:
    ldr   r0,=CTIMER1_DriverIRQHandler
    bx    r0
    .size CTIMER1_IRQHandler, . - CTIMER1_IRQHandler

    .align 1
    .thumb_func
    .weak SCT0_IRQHandler
    .type SCT0_IRQHandler, %function
SCT0_IRQHandler:
    ldr   r0,=SCT0_DriverIRQHandler
    bx    r0
    .size SCT0_IRQHandler, . - SCT0_IRQHandler

    .align 1
    .thumb_func
    .weak CTIMER3_IRQHandler
    .type CTIMER3_IRQHandler, %function
CTIMER3_IRQHandler:
    ldr   r0,=CTIMER3_DriverIRQHandler
    bx    r0
    .size CTIMER3_IRQHandler, . - CTIMER3_IRQHandler

    .align 1
    .thumb_func
    .weak LP_FLEXCOMM0_IRQHandler
    .type LP_FLEXCOMM0_IRQHandler, %function
LP_FLEXCOMM0_IRQHandler:
    ldr   r0,=LP_FLEXCOMM0_DriverIRQHandler
    bx    r0
    .size LP_FLEXCOMM0_IRQHandler, . - LP_FLEXCOMM0_IRQHandler

    .align 1
    .thumb_func
    .weak LP_FLEXCOMM1_IRQHandler
    .type LP_FLEXCOMM1_IRQHandler, %function
LP_FLEXCOMM1_IRQHandler:
    ldr   r0,=LP_FLEXCOMM1_DriverIRQHandler
    bx    r0
    .size LP_FLEXCOMM1_IRQHandler, . - LP_FLEXCOMM1_IRQHandler

    .align 1
    .thumb_func
    .weak LP_FLEXCOMM2_IRQHandler
    .type LP_FLEXCOMM2_IRQHandler, %function
LP_FLEXCOMM2_IRQHandler:
    ldr   r0,=LP_FLEXCOMM2_DriverIRQHandler
    bx    r0
    .size LP_FLEXCOMM2_IRQHandler, . - LP_FLEXCOMM2_IRQHandler

    .align 1
    .thumb_func
    .weak LP_FLEXCOMM3_IRQHandler
    .type LP_FLEXCOMM3_IRQHandler, %function
LP_FLEXCOMM3_IRQHandler:
    ldr   r0,=LP_FLEXCOMM3_DriverIRQHandler
    bx    r0
    .size LP_FLEXCOMM3_IRQHandler, . - LP_FLEXCOMM3_IRQHandler

    .align 1
    .thumb_func
    .weak LP_FLEXCOMM4_IRQHandler
    .type LP_FLEXCOMM4_IRQHandler, %function
LP_FLEXCOMM4_IRQHandler:
    ldr   r0,=LP_FLEXCOMM4_DriverIRQHandler
    bx    r0
    .size LP_FLEXCOMM4_IRQHandler, . - LP_FLEXCOMM4_IRQHandler

    .align 1
    .thumb_func
    .weak LP_FLEXCOMM5_IRQHandler
    .type LP_FLEXCOMM5_IRQHandler, %function
LP_FLEXCOMM5_IRQHandler:
    ldr   r0,=LP_FLEXCOMM5_DriverIRQHandler
    bx    r0
    .size LP_FLEXCOMM5_IRQHandler, . - LP_FLEXCOMM5_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI14_IRQHandler
    .type LPSPI14_IRQHandler, %function
LPSPI14_IRQHandler:
    ldr   r0,=LPSPI14_DriverIRQHandler
    bx    r0
    .size LPSPI14_IRQHandler, . - LPSPI14_IRQHandler

    .align 1
    .thumb_func
    .weak LPI2C15_IRQHandler
    .type LPI2C15_IRQHandler, %function
LPI2C15_IRQHandler:
    ldr   r0,=LPI2C15_DriverIRQHandler
    bx    r0
    .size LPI2C15_IRQHandler, . - LPI2C15_IRQHandler

    .align 1
    .thumb_func
    .weak ADC_IRQHandler
    .type ADC_IRQHandler, %function
ADC_IRQHandler:
    ldr   r0,=ADC_DriverIRQHandler
    bx    r0
    .size ADC_IRQHandler, . - ADC_IRQHandler

    .align 1
    .thumb_func
    .weak SDADC_IRQHandler
    .type SDADC_IRQHandler, %function
SDADC_IRQHandler:
    ldr   r0,=SDADC_DriverIRQHandler
    bx    r0
    .size SDADC_IRQHandler, . - SDADC_IRQHandler

    .align 1
    .thumb_func
    .weak ACMP_IRQHandler
    .type ACMP_IRQHandler, %function
ACMP_IRQHandler:
    ldr   r0,=ACMP_DriverIRQHandler
    bx    r0
    .size ACMP_IRQHandler, . - ACMP_IRQHandler

    .align 1
    .thumb_func
    .weak PDM_EVENT_IRQHandler
    .type PDM_EVENT_IRQHandler, %function
PDM_EVENT_IRQHandler:
    ldr   r0,=PDM_EVENT_DriverIRQHandler
    bx    r0
    .size PDM_EVENT_IRQHandler, . - PDM_EVENT_IRQHandler

    .align 1
    .thumb_func
    .weak PDM_HWVAD_EVENT_IRQHandler
    .type PDM_HWVAD_EVENT_IRQHandler, %function
PDM_HWVAD_EVENT_IRQHandler:
    ldr   r0,=PDM_HWVAD_EVENT_DriverIRQHandler
    bx    r0
    .size PDM_HWVAD_EVENT_IRQHandler, . - PDM_HWVAD_EVENT_IRQHandler

    .align 1
    .thumb_func
    .weak HYPERVISOR_IRQHandler
    .type HYPERVISOR_IRQHandler, %function
HYPERVISOR_IRQHandler:
    ldr   r0,=HYPERVISOR_DriverIRQHandler
    bx    r0
    .size HYPERVISOR_IRQHandler, . - HYPERVISOR_IRQHandler

    .align 1
    .thumb_func
    .weak SECURE_VIOLATION_IRQHandler
    .type SECURE_VIOLATION_IRQHandler, %function
SECURE_VIOLATION_IRQHandler:
    ldr   r0,=SECURE_VIOLATION_DriverIRQHandler
    bx    r0
    .size SECURE_VIOLATION_IRQHandler, . - SECURE_VIOLATION_IRQHandler

    .align 1
    .thumb_func
    .weak SENSE_HYPERVISOR_IRQHandler
    .type SENSE_HYPERVISOR_IRQHandler, %function
SENSE_HYPERVISOR_IRQHandler:
    ldr   r0,=SENSE_HYPERVISOR_DriverIRQHandler
    bx    r0
    .size SENSE_HYPERVISOR_IRQHandler, . - SENSE_HYPERVISOR_IRQHandler

    .align 1
    .thumb_func
    .weak SENSE_SECURE_VIOLATION_IRQHandler
    .type SENSE_SECURE_VIOLATION_IRQHandler, %function
SENSE_SECURE_VIOLATION_IRQHandler:
    ldr   r0,=SENSE_SECURE_VIOLATION_DriverIRQHandler
    bx    r0
    .size SENSE_SECURE_VIOLATION_IRQHandler, . - SENSE_SECURE_VIOLATION_IRQHandler

    .align 1
    .thumb_func
    .weak MEDIA_HYPERVISOR_IRQHandler
    .type MEDIA_HYPERVISOR_IRQHandler, %function
MEDIA_HYPERVISOR_IRQHandler:
    ldr   r0,=MEDIA_HYPERVISOR_DriverIRQHandler
    bx    r0
    .size MEDIA_HYPERVISOR_IRQHandler, . - MEDIA_HYPERVISOR_IRQHandler

    .align 1
    .thumb_func
    .weak MEDIA_SECURE_VIOLATION_IRQHandler
    .type MEDIA_SECURE_VIOLATION_IRQHandler, %function
MEDIA_SECURE_VIOLATION_IRQHandler:
    ldr   r0,=MEDIA_SECURE_VIOLATION_DriverIRQHandler
    bx    r0
    .size MEDIA_SECURE_VIOLATION_IRQHandler, . - MEDIA_SECURE_VIOLATION_IRQHandler

    .align 1
    .thumb_func
    .weak RTC0_ALARM_IRQHandler
    .type RTC0_ALARM_IRQHandler, %function
RTC0_ALARM_IRQHandler:
    ldr   r0,=RTC0_ALARM_DriverIRQHandler
    bx    r0
    .size RTC0_ALARM_IRQHandler, . - RTC0_ALARM_IRQHandler

    .align 1
    .thumb_func
    .weak RTC0_IRQHandler
    .type RTC0_IRQHandler, %function
RTC0_IRQHandler:
    ldr   r0,=RTC0_DriverIRQHandler
    bx    r0
    .size RTC0_IRQHandler, . - RTC0_IRQHandler

    .align 1
    .thumb_func
    .weak Reserved44_IRQHandler
    .type Reserved44_IRQHandler, %function
Reserved44_IRQHandler:
    ldr   r0,=Reserved44_DriverIRQHandler
    bx    r0
    .size Reserved44_IRQHandler, . - Reserved44_IRQHandler

    .align 1
    .thumb_func
    .weak MU0_A_IRQHandler
    .type MU0_A_IRQHandler, %function
MU0_A_IRQHandler:
    ldr   r0,=MU0_A_DriverIRQHandler
    bx    r0
    .size MU0_A_IRQHandler, . - MU0_A_IRQHandler

    .align 1
    .thumb_func
    .weak MU1_A_IRQHandler
    .type MU1_A_IRQHandler, %function
MU1_A_IRQHandler:
    ldr   r0,=MU1_A_DriverIRQHandler
    bx    r0
    .size MU1_A_IRQHandler, . - MU1_A_IRQHandler

    .align 1
    .thumb_func
    .weak Reserved47_IRQHandler
    .type Reserved47_IRQHandler, %function
Reserved47_IRQHandler:
    ldr   r0,=Reserved47_DriverIRQHandler
    bx    r0
    .size Reserved47_IRQHandler, . - Reserved47_IRQHandler

    .align 1
    .thumb_func
    .weak CTIMER2_IRQHandler
    .type CTIMER2_IRQHandler, %function
CTIMER2_IRQHandler:
    ldr   r0,=CTIMER2_DriverIRQHandler
    bx    r0
    .size CTIMER2_IRQHandler, . - CTIMER2_IRQHandler

    .align 1
    .thumb_func
    .weak CTIMER4_IRQHandler
    .type CTIMER4_IRQHandler, %function
CTIMER4_IRQHandler:
    ldr   r0,=CTIMER4_DriverIRQHandler
    bx    r0
    .size CTIMER4_IRQHandler, . - CTIMER4_IRQHandler

    .align 1
    .thumb_func
    .weak OS_EVENT_IRQHandler
    .type OS_EVENT_IRQHandler, %function
OS_EVENT_IRQHandler:
    ldr   r0,=OS_EVENT_DriverIRQHandler
    bx    r0
    .size OS_EVENT_IRQHandler, . - OS_EVENT_IRQHandler

    .align 1
    .thumb_func
    .weak LP_FLEXCOMM6_IRQHandler
    .type LP_FLEXCOMM6_IRQHandler, %function
LP_FLEXCOMM6_IRQHandler:
    ldr   r0,=LP_FLEXCOMM6_DriverIRQHandler
    bx    r0
    .size LP_FLEXCOMM6_IRQHandler, . - LP_FLEXCOMM6_IRQHandler

    .align 1
    .thumb_func
    .weak LP_FLEXCOMM7_IRQHandler
    .type LP_FLEXCOMM7_IRQHandler, %function
LP_FLEXCOMM7_IRQHandler:
    ldr   r0,=LP_FLEXCOMM7_DriverIRQHandler
    bx    r0
    .size LP_FLEXCOMM7_IRQHandler, . - LP_FLEXCOMM7_IRQHandler

    .align 1
    .thumb_func
    .weak USDHC0_IRQHandler
    .type USDHC0_IRQHandler, %function
USDHC0_IRQHandler:
    ldr   r0,=USDHC0_DriverIRQHandler
    bx    r0
    .size USDHC0_IRQHandler, . - USDHC0_IRQHandler

    .align 1
    .thumb_func
    .weak USDHC1_IRQHandler
    .type USDHC1_IRQHandler, %function
USDHC1_IRQHandler:
    ldr   r0,=USDHC1_DriverIRQHandler
    bx    r0
    .size USDHC1_IRQHandler, . - USDHC1_IRQHandler

    .align 1
    .thumb_func
    .weak I3C0_IRQHandler
    .type I3C0_IRQHandler, %function
I3C0_IRQHandler:
    ldr   r0,=I3C0_DriverIRQHandler
    bx    r0
    .size I3C0_IRQHandler, . - I3C0_IRQHandler

    .align 1
    .thumb_func
    .weak USB0_IRQHandler
    .type USB0_IRQHandler, %function
USB0_IRQHandler:
    ldr   r0,=USB0_DriverIRQHandler
    bx    r0
    .size USB0_IRQHandler, . - USB0_IRQHandler

    .align 1
    .thumb_func
    .weak USB1_IRQHandler
    .type USB1_IRQHandler, %function
USB1_IRQHandler:
    ldr   r0,=USB1_DriverIRQHandler
    bx    r0
    .size USB1_IRQHandler, . - USB1_IRQHandler

    .align 1
    .thumb_func
    .weak WDT0_IRQHandler
    .type WDT0_IRQHandler, %function
WDT0_IRQHandler:
    ldr   r0,=WDT0_DriverIRQHandler
    bx    r0
    .size WDT0_IRQHandler, . - WDT0_IRQHandler

    .align 1
    .thumb_func
    .weak WDT1_IRQHandler
    .type WDT1_IRQHandler, %function
WDT1_IRQHandler:
    ldr   r0,=WDT1_DriverIRQHandler
    bx    r0
    .size WDT1_IRQHandler, . - WDT1_IRQHandler

    .align 1
    .thumb_func
    .weak USBPHY0_IRQHandler
    .type USBPHY0_IRQHandler, %function
USBPHY0_IRQHandler:
    ldr   r0,=USBPHY0_DriverIRQHandler
    bx    r0
    .size USBPHY0_IRQHandler, . - USBPHY0_IRQHandler

    .align 1
    .thumb_func
    .weak PUF_IRQHandler
    .type PUF_IRQHandler, %function
PUF_IRQHandler:
    ldr   r0,=PUF_DriverIRQHandler
    bx    r0
    .size PUF_IRQHandler, . - PUF_IRQHandler

    .align 1
    .thumb_func
    .weak PMIC_IRQN_IRQHandler
    .type PMIC_IRQN_IRQHandler, %function
PMIC_IRQN_IRQHandler:
    ldr   r0,=PMIC_IRQN_DriverIRQHandler
    bx    r0
    .size PMIC_IRQN_IRQHandler, . - PMIC_IRQN_IRQHandler

    .align 1
    .thumb_func
    .weak LP_FLEXCOMM8_IRQHandler
    .type LP_FLEXCOMM8_IRQHandler, %function
LP_FLEXCOMM8_IRQHandler:
    ldr   r0,=LP_FLEXCOMM8_DriverIRQHandler
    bx    r0
    .size LP_FLEXCOMM8_IRQHandler, . - LP_FLEXCOMM8_IRQHandler

    .align 1
    .thumb_func
    .weak LP_FLEXCOMM9_IRQHandler
    .type LP_FLEXCOMM9_IRQHandler, %function
LP_FLEXCOMM9_IRQHandler:
    ldr   r0,=LP_FLEXCOMM9_DriverIRQHandler
    bx    r0
    .size LP_FLEXCOMM9_IRQHandler, . - LP_FLEXCOMM9_IRQHandler

    .align 1
    .thumb_func
    .weak LP_FLEXCOMM10_IRQHandler
    .type LP_FLEXCOMM10_IRQHandler, %function
LP_FLEXCOMM10_IRQHandler:
    ldr   r0,=LP_FLEXCOMM10_DriverIRQHandler
    bx    r0
    .size LP_FLEXCOMM10_IRQHandler, . - LP_FLEXCOMM10_IRQHandler

    .align 1
    .thumb_func
    .weak LP_FLEXCOMM11_IRQHandler
    .type LP_FLEXCOMM11_IRQHandler, %function
LP_FLEXCOMM11_IRQHandler:
    ldr   r0,=LP_FLEXCOMM11_DriverIRQHandler
    bx    r0
    .size LP_FLEXCOMM11_IRQHandler, . - LP_FLEXCOMM11_IRQHandler

    .align 1
    .thumb_func
    .weak LP_FLEXCOMM12_IRQHandler
    .type LP_FLEXCOMM12_IRQHandler, %function
LP_FLEXCOMM12_IRQHandler:
    ldr   r0,=LP_FLEXCOMM12_DriverIRQHandler
    bx    r0
    .size LP_FLEXCOMM12_IRQHandler, . - LP_FLEXCOMM12_IRQHandler

    .align 1
    .thumb_func
    .weak LP_FLEXCOMM13_IRQHandler
    .type LP_FLEXCOMM13_IRQHandler, %function
LP_FLEXCOMM13_IRQHandler:
    ldr   r0,=LP_FLEXCOMM13_DriverIRQHandler
    bx    r0
    .size LP_FLEXCOMM13_IRQHandler, . - LP_FLEXCOMM13_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI16_IRQHandler
    .type LPSPI16_IRQHandler, %function
LPSPI16_IRQHandler:
    ldr   r0,=LPSPI16_DriverIRQHandler
    bx    r0
    .size LPSPI16_IRQHandler, . - LPSPI16_IRQHandler

    .align 1
    .thumb_func
    .weak I3C1_IRQHandler
    .type I3C1_IRQHandler, %function
I3C1_IRQHandler:
    ldr   r0,=I3C1_DriverIRQHandler
    bx    r0
    .size I3C1_IRQHandler, . - I3C1_IRQHandler

    .align 1
    .thumb_func
    .weak FLEXIO_IRQHandler
    .type FLEXIO_IRQHandler, %function
FLEXIO_IRQHandler:
    ldr   r0,=FLEXIO_DriverIRQHandler
    bx    r0
    .size FLEXIO_IRQHandler, . - FLEXIO_IRQHandler

    .align 1
    .thumb_func
    .weak Reserved72_IRQHandler
    .type Reserved72_IRQHandler, %function
Reserved72_IRQHandler:
    ldr   r0,=Reserved72_DriverIRQHandler
    bx    r0
    .size Reserved72_IRQHandler, . - Reserved72_IRQHandler

    .align 1
    .thumb_func
    .weak Reserved73_IRQHandler
    .type Reserved73_IRQHandler, %function
Reserved73_IRQHandler:
    ldr   r0,=Reserved73_DriverIRQHandler
    bx    r0
    .size Reserved73_IRQHandler, . - Reserved73_IRQHandler

    .align 1
    .thumb_func
    .weak Reserved74_IRQHandler
    .type Reserved74_IRQHandler, %function
Reserved74_IRQHandler:
    ldr   r0,=Reserved74_DriverIRQHandler
    bx    r0
    .size Reserved74_IRQHandler, . - Reserved74_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA0_CH0_IRQHandler
    .type EDMA0_CH0_IRQHandler, %function
EDMA0_CH0_IRQHandler:
    ldr   r0,=EDMA0_CH0_DriverIRQHandler
    bx    r0
    .size EDMA0_CH0_IRQHandler, . - EDMA0_CH0_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA0_CH1_IRQHandler
    .type EDMA0_CH1_IRQHandler, %function
EDMA0_CH1_IRQHandler:
    ldr   r0,=EDMA0_CH1_DriverIRQHandler
    bx    r0
    .size EDMA0_CH1_IRQHandler, . - EDMA0_CH1_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA0_CH2_IRQHandler
    .type EDMA0_CH2_IRQHandler, %function
EDMA0_CH2_IRQHandler:
    ldr   r0,=EDMA0_CH2_DriverIRQHandler
    bx    r0
    .size EDMA0_CH2_IRQHandler, . - EDMA0_CH2_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA0_CH3_IRQHandler
    .type EDMA0_CH3_IRQHandler, %function
EDMA0_CH3_IRQHandler:
    ldr   r0,=EDMA0_CH3_DriverIRQHandler
    bx    r0
    .size EDMA0_CH3_IRQHandler, . - EDMA0_CH3_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA0_CH4_IRQHandler
    .type EDMA0_CH4_IRQHandler, %function
EDMA0_CH4_IRQHandler:
    ldr   r0,=EDMA0_CH4_DriverIRQHandler
    bx    r0
    .size EDMA0_CH4_IRQHandler, . - EDMA0_CH4_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA0_CH5_IRQHandler
    .type EDMA0_CH5_IRQHandler, %function
EDMA0_CH5_IRQHandler:
    ldr   r0,=EDMA0_CH5_DriverIRQHandler
    bx    r0
    .size EDMA0_CH5_IRQHandler, . - EDMA0_CH5_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA0_CH6_IRQHandler
    .type EDMA0_CH6_IRQHandler, %function
EDMA0_CH6_IRQHandler:
    ldr   r0,=EDMA0_CH6_DriverIRQHandler
    bx    r0
    .size EDMA0_CH6_IRQHandler, . - EDMA0_CH6_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA0_CH7_IRQHandler
    .type EDMA0_CH7_IRQHandler, %function
EDMA0_CH7_IRQHandler:
    ldr   r0,=EDMA0_CH7_DriverIRQHandler
    bx    r0
    .size EDMA0_CH7_IRQHandler, . - EDMA0_CH7_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA0_CH8_IRQHandler
    .type EDMA0_CH8_IRQHandler, %function
EDMA0_CH8_IRQHandler:
    ldr   r0,=EDMA0_CH8_DriverIRQHandler
    bx    r0
    .size EDMA0_CH8_IRQHandler, . - EDMA0_CH8_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA0_CH9_IRQHandler
    .type EDMA0_CH9_IRQHandler, %function
EDMA0_CH9_IRQHandler:
    ldr   r0,=EDMA0_CH9_DriverIRQHandler
    bx    r0
    .size EDMA0_CH9_IRQHandler, . - EDMA0_CH9_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA0_CH10_IRQHandler
    .type EDMA0_CH10_IRQHandler, %function
EDMA0_CH10_IRQHandler:
    ldr   r0,=EDMA0_CH10_DriverIRQHandler
    bx    r0
    .size EDMA0_CH10_IRQHandler, . - EDMA0_CH10_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA0_CH11_IRQHandler
    .type EDMA0_CH11_IRQHandler, %function
EDMA0_CH11_IRQHandler:
    ldr   r0,=EDMA0_CH11_DriverIRQHandler
    bx    r0
    .size EDMA0_CH11_IRQHandler, . - EDMA0_CH11_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA0_CH12_IRQHandler
    .type EDMA0_CH12_IRQHandler, %function
EDMA0_CH12_IRQHandler:
    ldr   r0,=EDMA0_CH12_DriverIRQHandler
    bx    r0
    .size EDMA0_CH12_IRQHandler, . - EDMA0_CH12_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA0_CH13_IRQHandler
    .type EDMA0_CH13_IRQHandler, %function
EDMA0_CH13_IRQHandler:
    ldr   r0,=EDMA0_CH13_DriverIRQHandler
    bx    r0
    .size EDMA0_CH13_IRQHandler, . - EDMA0_CH13_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA0_CH14_IRQHandler
    .type EDMA0_CH14_IRQHandler, %function
EDMA0_CH14_IRQHandler:
    ldr   r0,=EDMA0_CH14_DriverIRQHandler
    bx    r0
    .size EDMA0_CH14_IRQHandler, . - EDMA0_CH14_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA0_CH15_IRQHandler
    .type EDMA0_CH15_IRQHandler, %function
EDMA0_CH15_IRQHandler:
    ldr   r0,=EDMA0_CH15_DriverIRQHandler
    bx    r0
    .size EDMA0_CH15_IRQHandler, . - EDMA0_CH15_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA1_CH0_IRQHandler
    .type EDMA1_CH0_IRQHandler, %function
EDMA1_CH0_IRQHandler:
    ldr   r0,=EDMA1_CH0_DriverIRQHandler
    bx    r0
    .size EDMA1_CH0_IRQHandler, . - EDMA1_CH0_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA1_CH1_IRQHandler
    .type EDMA1_CH1_IRQHandler, %function
EDMA1_CH1_IRQHandler:
    ldr   r0,=EDMA1_CH1_DriverIRQHandler
    bx    r0
    .size EDMA1_CH1_IRQHandler, . - EDMA1_CH1_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA1_CH2_IRQHandler
    .type EDMA1_CH2_IRQHandler, %function
EDMA1_CH2_IRQHandler:
    ldr   r0,=EDMA1_CH2_DriverIRQHandler
    bx    r0
    .size EDMA1_CH2_IRQHandler, . - EDMA1_CH2_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA1_CH3_IRQHandler
    .type EDMA1_CH3_IRQHandler, %function
EDMA1_CH3_IRQHandler:
    ldr   r0,=EDMA1_CH3_DriverIRQHandler
    bx    r0
    .size EDMA1_CH3_IRQHandler, . - EDMA1_CH3_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA1_CH4_IRQHandler
    .type EDMA1_CH4_IRQHandler, %function
EDMA1_CH4_IRQHandler:
    ldr   r0,=EDMA1_CH4_DriverIRQHandler
    bx    r0
    .size EDMA1_CH4_IRQHandler, . - EDMA1_CH4_IRQHandler

