nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/gcc/startup_MIMXRT735S_cm33_core0.S
    .align 1
    .thumb_func
    .weak EDMA1_CH5_IRQHandler
    .type EDMA1_CH5_IRQHandler, %function
EDMA1_CH5_IRQHandler:
    ldr   r0,=EDMA1_CH5_DriverIRQHandler
    bx    r0
    .size EDMA1_CH5_IRQHandler, . - EDMA1_CH5_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA1_CH6_IRQHandler
    .type EDMA1_CH6_IRQHandler, %function
EDMA1_CH6_IRQHandler:
    ldr   r0,=EDMA1_CH6_DriverIRQHandler
    bx    r0
    .size EDMA1_CH6_IRQHandler, . - EDMA1_CH6_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA1_CH7_IRQHandler
    .type EDMA1_CH7_IRQHandler, %function
EDMA1_CH7_IRQHandler:
    ldr   r0,=EDMA1_CH7_DriverIRQHandler
    bx    r0
    .size EDMA1_CH7_IRQHandler, . - EDMA1_CH7_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA1_CH8_IRQHandler
    .type EDMA1_CH8_IRQHandler, %function
EDMA1_CH8_IRQHandler:
    ldr   r0,=EDMA1_CH8_DriverIRQHandler
    bx    r0
    .size EDMA1_CH8_IRQHandler, . - EDMA1_CH8_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA1_CH9_IRQHandler
    .type EDMA1_CH9_IRQHandler, %function
EDMA1_CH9_IRQHandler:
    ldr   r0,=EDMA1_CH9_DriverIRQHandler
    bx    r0
    .size EDMA1_CH9_IRQHandler, . - EDMA1_CH9_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA1_CH10_IRQHandler
    .type EDMA1_CH10_IRQHandler, %function
EDMA1_CH10_IRQHandler:
    ldr   r0,=EDMA1_CH10_DriverIRQHandler
    bx    r0
    .size EDMA1_CH10_IRQHandler, . - EDMA1_CH10_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA1_CH11_IRQHandler
    .type EDMA1_CH11_IRQHandler, %function
EDMA1_CH11_IRQHandler:
    ldr   r0,=EDMA1_CH11_DriverIRQHandler
    bx    r0
    .size EDMA1_CH11_IRQHandler, . - EDMA1_CH11_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA1_CH12_IRQHandler
    .type EDMA1_CH12_IRQHandler, %function
EDMA1_CH12_IRQHandler:
    ldr   r0,=EDMA1_CH12_DriverIRQHandler
    bx    r0
    .size EDMA1_CH12_IRQHandler, . - EDMA1_CH12_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA1_CH13_IRQHandler
    .type EDMA1_CH13_IRQHandler, %function
EDMA1_CH13_IRQHandler:
    ldr   r0,=EDMA1_CH13_DriverIRQHandler
    bx    r0
    .size EDMA1_CH13_IRQHandler, . - EDMA1_CH13_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA1_CH14_IRQHandler
    .type EDMA1_CH14_IRQHandler, %function
EDMA1_CH14_IRQHandler:
    ldr   r0,=EDMA1_CH14_DriverIRQHandler
    bx    r0
    .size EDMA1_CH14_IRQHandler, . - EDMA1_CH14_IRQHandler

    .align 1
    .thumb_func
    .weak EDMA1_CH15_IRQHandler
    .type EDMA1_CH15_IRQHandler, %function
EDMA1_CH15_IRQHandler:
    ldr   r0,=EDMA1_CH15_DriverIRQHandler
    bx    r0
    .size EDMA1_CH15_IRQHandler, . - EDMA1_CH15_IRQHandler

    .align 1
    .thumb_func
    .weak GPIO00_IRQHandler
    .type GPIO00_IRQHandler, %function
GPIO00_IRQHandler:
    ldr   r0,=GPIO00_DriverIRQHandler
    bx    r0
    .size GPIO00_IRQHandler, . - GPIO00_IRQHandler

    .align 1
    .thumb_func
    .weak GPIO01_IRQHandler
    .type GPIO01_IRQHandler, %function
GPIO01_IRQHandler:
    ldr   r0,=GPIO01_DriverIRQHandler
    bx    r0
    .size GPIO01_IRQHandler, . - GPIO01_IRQHandler

    .align 1
    .thumb_func
    .weak GPIO10_IRQHandler
    .type GPIO10_IRQHandler, %function
GPIO10_IRQHandler:
    ldr   r0,=GPIO10_DriverIRQHandler
    bx    r0
    .size GPIO10_IRQHandler, . - GPIO10_IRQHandler

    .align 1
    .thumb_func
    .weak GPIO11_IRQHandler
    .type GPIO11_IRQHandler, %function
GPIO11_IRQHandler:
    ldr   r0,=GPIO11_DriverIRQHandler
    bx    r0
    .size GPIO11_IRQHandler, . - GPIO11_IRQHandler

    .align 1
    .thumb_func
    .weak GPIO20_IRQHandler
    .type GPIO20_IRQHandler, %function
GPIO20_IRQHandler:
    ldr   r0,=GPIO20_DriverIRQHandler
    bx    r0
    .size GPIO20_IRQHandler, . - GPIO20_IRQHandler

    .align 1
    .thumb_func
    .weak GPIO21_IRQHandler
    .type GPIO21_IRQHandler, %function
GPIO21_IRQHandler:
    ldr   r0,=GPIO21_DriverIRQHandler
    bx    r0
    .size GPIO21_IRQHandler, . - GPIO21_IRQHandler

    .align 1
    .thumb_func
    .weak GPIO30_IRQHandler
    .type GPIO30_IRQHandler, %function
GPIO30_IRQHandler:
    ldr   r0,=GPIO30_DriverIRQHandler
    bx    r0
    .size GPIO30_IRQHandler, . - GPIO30_IRQHandler

    .align 1
    .thumb_func
    .weak GPIO31_IRQHandler
    .type GPIO31_IRQHandler, %function
GPIO31_IRQHandler:
    ldr   r0,=GPIO31_DriverIRQHandler
    bx    r0
    .size GPIO31_IRQHandler, . - GPIO31_IRQHandler

    .align 1
    .thumb_func
    .weak GPIO40_IRQHandler
    .type GPIO40_IRQHandler, %function
GPIO40_IRQHandler:
    ldr   r0,=GPIO40_DriverIRQHandler
    bx    r0
    .size GPIO40_IRQHandler, . - GPIO40_IRQHandler

    .align 1
    .thumb_func
    .weak GPIO41_IRQHandler
    .type GPIO41_IRQHandler, %function
GPIO41_IRQHandler:
    ldr   r0,=GPIO41_DriverIRQHandler
    bx    r0
    .size GPIO41_IRQHandler, . - GPIO41_IRQHandler

    .align 1
    .thumb_func
    .weak GPIO50_IRQHandler
    .type GPIO50_IRQHandler, %function
GPIO50_IRQHandler:
    ldr   r0,=GPIO50_DriverIRQHandler
    bx    r0
    .size GPIO50_IRQHandler, . - GPIO50_IRQHandler

    .align 1
    .thumb_func
    .weak GPIO51_IRQHandler
    .type GPIO51_IRQHandler, %function
GPIO51_IRQHandler:
    ldr   r0,=GPIO51_DriverIRQHandler
    bx    r0
    .size GPIO51_IRQHandler, . - GPIO51_IRQHandler

    .align 1
    .thumb_func
    .weak GPIO60_IRQHandler
    .type GPIO60_IRQHandler, %function
GPIO60_IRQHandler:
    ldr   r0,=GPIO60_DriverIRQHandler
    bx    r0
    .size GPIO60_IRQHandler, . - GPIO60_IRQHandler

    .align 1
    .thumb_func
    .weak GPIO61_IRQHandler
    .type GPIO61_IRQHandler, %function
GPIO61_IRQHandler:
    ldr   r0,=GPIO61_DriverIRQHandler
    bx    r0
    .size GPIO61_IRQHandler, . - GPIO61_IRQHandler

    .align 1
    .thumb_func
    .weak GPIO70_IRQHandler
    .type GPIO70_IRQHandler, %function
GPIO70_IRQHandler:
    ldr   r0,=GPIO70_DriverIRQHandler
    bx    r0
    .size GPIO70_IRQHandler, . - GPIO70_IRQHandler

    .align 1
    .thumb_func
    .weak GPIO71_IRQHandler
    .type GPIO71_IRQHandler, %function
GPIO71_IRQHandler:
    ldr   r0,=GPIO71_DriverIRQHandler
    bx    r0
    .size GPIO71_IRQHandler, . - GPIO71_IRQHandler

    .align 1
    .thumb_func
    .weak PIN_INT0_IRQHandler
    .type PIN_INT0_IRQHandler, %function
PIN_INT0_IRQHandler:
    ldr   r0,=PIN_INT0_DriverIRQHandler
    bx    r0
    .size PIN_INT0_IRQHandler, . - PIN_INT0_IRQHandler

    .align 1
    .thumb_func
    .weak PIN_INT1_IRQHandler
    .type PIN_INT1_IRQHandler, %function
PIN_INT1_IRQHandler:
    ldr   r0,=PIN_INT1_DriverIRQHandler
    bx    r0
    .size PIN_INT1_IRQHandler, . - PIN_INT1_IRQHandler

    .align 1
    .thumb_func
    .weak PIN_INT2_IRQHandler
    .type PIN_INT2_IRQHandler, %function
PIN_INT2_IRQHandler:
    ldr   r0,=PIN_INT2_DriverIRQHandler
    bx    r0
    .size PIN_INT2_IRQHandler, . - PIN_INT2_IRQHandler

    .align 1
    .thumb_func
    .weak PIN_INT3_IRQHandler
    .type PIN_INT3_IRQHandler, %function
PIN_INT3_IRQHandler:
    ldr   r0,=PIN_INT3_DriverIRQHandler
    bx    r0
    .size PIN_INT3_IRQHandler, . - PIN_INT3_IRQHandler

    .align 1
    .thumb_func
    .weak PIN_INT4_IRQHandler
    .type PIN_INT4_IRQHandler, %function
PIN_INT4_IRQHandler:
    ldr   r0,=PIN_INT4_DriverIRQHandler
    bx    r0
    .size PIN_INT4_IRQHandler, . - PIN_INT4_IRQHandler

    .align 1
    .thumb_func
    .weak PIN_INT5_IRQHandler
    .type PIN_INT5_IRQHandler, %function
PIN_INT5_IRQHandler:
    ldr   r0,=PIN_INT5_DriverIRQHandler
    bx    r0
    .size PIN_INT5_IRQHandler, . - PIN_INT5_IRQHandler

    .align 1
    .thumb_func
    .weak PIN_INT6_IRQHandler
    .type PIN_INT6_IRQHandler, %function
PIN_INT6_IRQHandler:
    ldr   r0,=PIN_INT6_DriverIRQHandler
    bx    r0
    .size PIN_INT6_IRQHandler, . - PIN_INT6_IRQHandler

    .align 1
    .thumb_func
    .weak PIN_INT7_IRQHandler
    .type PIN_INT7_IRQHandler, %function
PIN_INT7_IRQHandler:
    ldr   r0,=PIN_INT7_DriverIRQHandler
    bx    r0
    .size PIN_INT7_IRQHandler, . - PIN_INT7_IRQHandler

    .align 1
    .thumb_func
    .weak SAI0_IRQHandler
    .type SAI0_IRQHandler, %function
SAI0_IRQHandler:
    ldr   r0,=SAI0_DriverIRQHandler
    bx    r0
    .size SAI0_IRQHandler, . - SAI0_IRQHandler

    .align 1
    .thumb_func
    .weak SAI1_IRQHandler
    .type SAI1_IRQHandler, %function
SAI1_IRQHandler:
    ldr   r0,=SAI1_DriverIRQHandler
    bx    r0
    .size SAI1_IRQHandler, . - SAI1_IRQHandler

    .align 1
    .thumb_func
    .weak SAI2_IRQHandler
    .type SAI2_IRQHandler, %function
SAI2_IRQHandler:
    ldr   r0,=SAI2_DriverIRQHandler
    bx    r0
    .size SAI2_IRQHandler, . - SAI2_IRQHandler

    .align 1
    .thumb_func
    .weak XSPI0_IRQHandler
    .type XSPI0_IRQHandler, %function
XSPI0_IRQHandler:
    ldr   r0,=XSPI0_DriverIRQHandler
    bx    r0
    .size XSPI0_IRQHandler, . - XSPI0_IRQHandler

    .align 1
    .thumb_func
    .weak XSPI1_IRQHandler
    .type XSPI1_IRQHandler, %function
XSPI1_IRQHandler:
    ldr   r0,=XSPI1_DriverIRQHandler
    bx    r0
    .size XSPI1_IRQHandler, . - XSPI1_IRQHandler

    .align 1
    .thumb_func
    .weak XSPI2_IRQHandler
    .type XSPI2_IRQHandler, %function
XSPI2_IRQHandler:
    ldr   r0,=XSPI2_DriverIRQHandler
    bx    r0
    .size XSPI2_IRQHandler, . - XSPI2_IRQHandler

    .align 1
    .thumb_func
    .weak MMU0_IRQHandler
    .type MMU0_IRQHandler, %function
MMU0_IRQHandler:
    ldr   r0,=MMU0_DriverIRQHandler
    bx    r0
    .size MMU0_IRQHandler, . - MMU0_IRQHandler

    .align 1
    .thumb_func
    .weak MMU1_IRQHandler
    .type MMU1_IRQHandler, %function
MMU1_IRQHandler:
    ldr   r0,=MMU1_DriverIRQHandler
    bx    r0
    .size MMU1_IRQHandler, . - MMU1_IRQHandler

    .align 1
    .thumb_func
    .weak MMU2_IRQHandler
    .type MMU2_IRQHandler, %function
MMU2_IRQHandler:
    ldr   r0,=MMU2_DriverIRQHandler
    bx    r0
    .size MMU2_IRQHandler, . - MMU2_IRQHandler

    .align 1
    .thumb_func
    .weak Freqme_IRQHandler
    .type Freqme_IRQHandler, %function
Freqme_IRQHandler:
    ldr   r0,=Freqme_DriverIRQHandler
    bx    r0
    .size Freqme_IRQHandler, . - Freqme_IRQHandler

    .align 1
    .thumb_func
    .weak GDET0_IRQHandler
    .type GDET0_IRQHandler, %function
GDET0_IRQHandler:
    ldr   r0,=GDET0_DriverIRQHandler
    bx    r0
    .size GDET0_IRQHandler, . - GDET0_IRQHandler

    .align 1
    .thumb_func
    .weak GDET1_IRQHandler
    .type GDET1_IRQHandler, %function
GDET1_IRQHandler:
    ldr   r0,=GDET1_DriverIRQHandler
    bx    r0
    .size GDET1_IRQHandler, . - GDET1_IRQHandler

    .align 1
    .thumb_func
    .weak GDET2_IRQHandler
    .type GDET2_IRQHandler, %function
GDET2_IRQHandler:
    ldr   r0,=GDET2_DriverIRQHandler
    bx    r0
    .size GDET2_IRQHandler, . - GDET2_IRQHandler

    .align 1
    .thumb_func
    .weak GDET3_IRQHandler
    .type GDET3_IRQHandler, %function
GDET3_IRQHandler:
    ldr   r0,=GDET3_DriverIRQHandler
    bx    r0
    .size GDET3_IRQHandler, . - GDET3_IRQHandler

    .align 1
    .thumb_func
    .weak CDOG0_IRQHandler
    .type CDOG0_IRQHandler, %function
CDOG0_IRQHandler:
    ldr   r0,=CDOG0_DriverIRQHandler
    bx    r0
    .size CDOG0_IRQHandler, . - CDOG0_IRQHandler

    .align 1
    .thumb_func
    .weak CDOG1_IRQHandler
    .type CDOG1_IRQHandler, %function
CDOG1_IRQHandler:
    ldr   r0,=CDOG1_DriverIRQHandler
    bx    r0
    .size CDOG1_IRQHandler, . - CDOG1_IRQHandler

    .align 1
    .thumb_func
    .weak CDOG2_IRQHandler
    .type CDOG2_IRQHandler, %function
CDOG2_IRQHandler:
    ldr   r0,=CDOG2_DriverIRQHandler
    bx    r0
    .size CDOG2_IRQHandler, . - CDOG2_IRQHandler

    .align 1
    .thumb_func
    .weak ITRC0_IRQHandler
    .type ITRC0_IRQHandler, %function
ITRC0_IRQHandler:
    ldr   r0,=ITRC0_DriverIRQHandler
    bx    r0
    .size ITRC0_IRQHandler, . - ITRC0_IRQHandler

    .align 1
    .thumb_func
    .weak ELS_IRQHandler
    .type ELS_IRQHandler, %function
ELS_IRQHandler:
    ldr   r0,=ELS_DriverIRQHandler
    bx    r0
    .size ELS_IRQHandler, . - ELS_IRQHandler

    .align 1
    .thumb_func
    .weak PKC_IRQHandler
    .type PKC_IRQHandler, %function
PKC_IRQHandler:
    ldr   r0,=PKC_DriverIRQHandler
    bx    r0
    .size PKC_IRQHandler, . - PKC_IRQHandler

    .align 1
    .thumb_func
    .weak OSCCA_IRQHandler
    .type OSCCA_IRQHandler, %function
OSCCA_IRQHandler:
    ldr   r0,=OSCCA_DriverIRQHandler
    bx    r0
    .size OSCCA_IRQHandler, . - OSCCA_IRQHandler

    .align 1
    .thumb_func
    .weak SLEEPCON0_IRQHandler
    .type SLEEPCON0_IRQHandler, %function
SLEEPCON0_IRQHandler:
    ldr   r0,=SLEEPCON0_DriverIRQHandler
    bx    r0
    .size SLEEPCON0_IRQHandler, . - SLEEPCON0_IRQHandler

    .align 1
    .thumb_func
    .weak CPU0_IRQHandler
    .type CPU0_IRQHandler, %function
CPU0_IRQHandler:
    ldr   r0,=CPU0_DriverIRQHandler
    bx    r0
    .size CPU0_IRQHandler, . - CPU0_IRQHandler

    .align 1
    .thumb_func
    .weak PMC_IRQHandler
    .type PMC_IRQHandler, %function
PMC_IRQHandler:
    ldr   r0,=PMC_DriverIRQHandler
    bx    r0
    .size PMC_IRQHandler, . - PMC_IRQHandler

    .align 1
    .thumb_func
    .weak Reserved155_IRQHandler
    .type Reserved155_IRQHandler, %function
Reserved155_IRQHandler:
    ldr   r0,=Reserved155_DriverIRQHandler
    bx    r0
    .size Reserved155_IRQHandler, . - Reserved155_IRQHandler

    .align 1
    .thumb_func
    .weak Reserved156_IRQHandler
    .type Reserved156_IRQHandler, %function
Reserved156_IRQHandler:
    ldr   r0,=Reserved156_DriverIRQHandler
    bx    r0
    .size Reserved156_IRQHandler, . - Reserved156_IRQHandler

    .align 1
    .thumb_func
    .weak NPU_IRQHandler
    .type NPU_IRQHandler, %function
NPU_IRQHandler:
    ldr   r0,=NPU_DriverIRQHandler
    bx    r0
    .size NPU_IRQHandler, . - NPU_IRQHandler

    .align 1
    .thumb_func
    .weak TRNG_IRQHandler
    .type TRNG_IRQHandler, %function
TRNG_IRQHandler:
    ldr   r0,=TRNG_DriverIRQHandler
    bx    r0
    .size TRNG_IRQHandler, . - TRNG_IRQHandler

    .align 1
    .thumb_func
    .weak TEMPDET0_IRQHandler
    .type TEMPDET0_IRQHandler, %function
TEMPDET0_IRQHandler:
    ldr   r0,=TEMPDET0_DriverIRQHandler
    bx    r0
    .size TEMPDET0_IRQHandler, . - TEMPDET0_IRQHandler

    .align 1
    .thumb_func
    .weak TEMPDET1_IRQHandler
    .type TEMPDET1_IRQHandler, %function
TEMPDET1_IRQHandler:
    ldr   r0,=TEMPDET1_DriverIRQHandler
    bx    r0
    .size TEMPDET1_IRQHandler, . - TEMPDET1_IRQHandler

    .align 1
    .thumb_func
    .weak EZHV_IRQHandler
    .type EZHV_IRQHandler, %function
EZHV_IRQHandler:
    ldr   r0,=EZHV_DriverIRQHandler
    bx    r0
    .size EZHV_IRQHandler, . - EZHV_IRQHandler

    .align 1
    .thumb_func
    .weak GLIKEY0_IRQHandler
    .type GLIKEY0_IRQHandler, %function
GLIKEY0_IRQHandler:
    ldr   r0,=GLIKEY0_DriverIRQHandler
    bx    r0
    .size GLIKEY0_IRQHandler, . - GLIKEY0_IRQHandler

    .align 1
    .thumb_func
    .weak GLIKEY2_IRQHandler
    .type GLIKEY2_IRQHandler, %function
GLIKEY2_IRQHandler:
    ldr   r0,=GLIKEY2_DriverIRQHandler
    bx    r0
    .size GLIKEY2_IRQHandler, . - GLIKEY2_IRQHandler

    .align 1
    .thumb_func
    .weak GLIKEY3_IRQHandler
    .type GLIKEY3_IRQHandler, %function
GLIKEY3_IRQHandler:
    ldr   r0,=GLIKEY3_DriverIRQHandler
    bx    r0
    .size GLIKEY3_IRQHandler, . - GLIKEY3_IRQHandler

    .align 1
    .thumb_func
    .weak GLIKEY5_IRQHandler
    .type GLIKEY5_IRQHandler, %function
GLIKEY5_IRQHandler:
    ldr   r0,=GLIKEY5_DriverIRQHandler
    bx    r0
    .size GLIKEY5_IRQHandler, . - GLIKEY5_IRQHandler

    .align 1
    .thumb_func
    .weak PVTS0_CPU0_IRQHandler
    .type PVTS0_CPU0_IRQHandler, %function
PVTS0_CPU0_IRQHandler:
    ldr   r0,=PVTS0_CPU0_DriverIRQHandler
    bx    r0
    .size PVTS0_CPU0_IRQHandler, . - PVTS0_CPU0_IRQHandler

    .align 1
    .thumb_func
    .weak Reserved167_IRQHandler
    .type Reserved167_IRQHandler, %function
Reserved167_IRQHandler:
    ldr   r0,=Reserved167_DriverIRQHandler
    bx    r0
    .size Reserved167_IRQHandler, . - Reserved167_IRQHandler

    .align 1
    .thumb_func
    .weak PVTS0_HIFI4_IRQHandler
    .type PVTS0_HIFI4_IRQHandler, %function
PVTS0_HIFI4_IRQHandler:
    ldr   r0,=PVTS0_HIFI4_DriverIRQHandler
    bx    r0
    .size PVTS0_HIFI4_IRQHandler, . - PVTS0_HIFI4_IRQHandler

    .align 1
    .thumb_func
    .weak Reserved169_IRQHandler
    .type Reserved169_IRQHandler, %function
Reserved169_IRQHandler:
    ldr   r0,=Reserved169_DriverIRQHandler
    bx    r0
    .size Reserved169_IRQHandler, . - Reserved169_IRQHandler

    .align 1
    .thumb_func
    .weak FRO0_IRQHandler
    .type FRO0_IRQHandler, %function
FRO0_IRQHandler:
    ldr   r0,=FRO0_DriverIRQHandler
    bx    r0
    .size FRO0_IRQHandler, . - FRO0_IRQHandler

    .align 1
    .thumb_func
    .weak FRO1_IRQHandler
    .type FRO1_IRQHandler, %function
FRO1_IRQHandler:
    ldr   r0,=FRO1_DriverIRQHandler
    bx    r0
    .size FRO1_IRQHandler, . - FRO1_IRQHandler

    .align 1
    .thumb_func
    .weak FRO2_IRQHandler
    .type FRO2_IRQHandler, %function
FRO2_IRQHandler:
    ldr   r0,=FRO2_DriverIRQHandler
    bx    r0
    .size FRO2_IRQHandler, . - FRO2_IRQHandler

    .align 1
    .thumb_func
    .weak OCOTP_IRQHandler
    .type OCOTP_IRQHandler, %function
OCOTP_IRQHandler:
    ldr   r0,=OCOTP_DriverIRQHandler
    bx    r0
    .size OCOTP_IRQHandler, . - OCOTP_IRQHandler


