nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/gcc/startup_MIMXRT735S_cm33_core0.S
/*    Macro to define default handlers. Default handler
 *    will be weak symbol and just dead loops. They can be
 *    overwritten by other handlers */
    .macro def_irq_handler  handler_name
    .weak \handler_name
    .set  \handler_name, DefaultISR
    .endm
/* Exception Handlers */
    def_irq_handler    MemManage_Handler
    def_irq_handler    BusFault_Handler
    def_irq_handler    UsageFault_Handler
    def_irq_handler    SecureFault_Handler
    def_irq_handler    DebugMon_Handler
    def_irq_handler    Reserved16_DriverIRQHandler
    def_irq_handler    UTICK0_DriverIRQHandler
    def_irq_handler    MRT0_DriverIRQHandler
    def_irq_handler    CTIMER0_DriverIRQHandler
    def_irq_handler    CTIMER1_DriverIRQHandler
    def_irq_handler    SCT0_DriverIRQHandler
    def_irq_handler    CTIMER3_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM0_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM1_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM2_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM3_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM4_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM5_DriverIRQHandler
    def_irq_handler    LPSPI14_DriverIRQHandler
    def_irq_handler    LPI2C15_DriverIRQHandler
    def_irq_handler    ADC_DriverIRQHandler
    def_irq_handler    SDADC_DriverIRQHandler
    def_irq_handler    ACMP_DriverIRQHandler
    def_irq_handler    PDM_EVENT_DriverIRQHandler
    def_irq_handler    PDM_HWVAD_EVENT_DriverIRQHandler
    def_irq_handler    HYPERVISOR_DriverIRQHandler
    def_irq_handler    SECURE_VIOLATION_DriverIRQHandler
    def_irq_handler    SENSE_HYPERVISOR_DriverIRQHandler
    def_irq_handler    SENSE_SECURE_VIOLATION_DriverIRQHandler
    def_irq_handler    MEDIA_HYPERVISOR_DriverIRQHandler
    def_irq_handler    MEDIA_SECURE_VIOLATION_DriverIRQHandler
    def_irq_handler    RTC0_ALARM_DriverIRQHandler
    def_irq_handler    RTC0_DriverIRQHandler
    def_irq_handler    Reserved44_DriverIRQHandler
    def_irq_handler    MU0_A_DriverIRQHandler
    def_irq_handler    MU1_A_DriverIRQHandler
    def_irq_handler    Reserved47_DriverIRQHandler
    def_irq_handler    CTIMER2_DriverIRQHandler
    def_irq_handler    CTIMER4_DriverIRQHandler
    def_irq_handler    OS_EVENT_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM6_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM7_DriverIRQHandler
    def_irq_handler    USDHC0_DriverIRQHandler
    def_irq_handler    USDHC1_DriverIRQHandler
    def_irq_handler    I3C0_DriverIRQHandler
    def_irq_handler    USB0_DriverIRQHandler
    def_irq_handler    USB1_DriverIRQHandler
    def_irq_handler    WDT0_DriverIRQHandler
    def_irq_handler    WDT1_DriverIRQHandler
    def_irq_handler    USBPHY0_DriverIRQHandler
    def_irq_handler    PUF_DriverIRQHandler
    def_irq_handler    PMIC_IRQN_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM8_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM9_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM10_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM11_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM12_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM13_DriverIRQHandler
    def_irq_handler    LPSPI16_DriverIRQHandler
    def_irq_handler    I3C1_DriverIRQHandler
    def_irq_handler    FLEXIO_DriverIRQHandler
    def_irq_handler    Reserved72_DriverIRQHandler
    def_irq_handler    Reserved73_DriverIRQHandler
    def_irq_handler    Reserved74_DriverIRQHandler
    def_irq_handler    EDMA0_CH0_DriverIRQHandler
    def_irq_handler    EDMA0_CH1_DriverIRQHandler
    def_irq_handler    EDMA0_CH2_DriverIRQHandler
    def_irq_handler    EDMA0_CH3_DriverIRQHandler
    def_irq_handler    EDMA0_CH4_DriverIRQHandler
    def_irq_handler    EDMA0_CH5_DriverIRQHandler
    def_irq_handler    EDMA0_CH6_DriverIRQHandler
    def_irq_handler    EDMA0_CH7_DriverIRQHandler
    def_irq_handler    EDMA0_CH8_DriverIRQHandler
    def_irq_handler    EDMA0_CH9_DriverIRQHandler
    def_irq_handler    EDMA0_CH10_DriverIRQHandler
    def_irq_handler    EDMA0_CH11_DriverIRQHandler
    def_irq_handler    EDMA0_CH12_DriverIRQHandler
    def_irq_handler    EDMA0_CH13_DriverIRQHandler
    def_irq_handler    EDMA0_CH14_DriverIRQHandler
    def_irq_handler    EDMA0_CH15_DriverIRQHandler
    def_irq_handler    EDMA1_CH0_DriverIRQHandler
    def_irq_handler    EDMA1_CH1_DriverIRQHandler
    def_irq_handler    EDMA1_CH2_DriverIRQHandler
    def_irq_handler    EDMA1_CH3_DriverIRQHandler
    def_irq_handler    EDMA1_CH4_DriverIRQHandler
    def_irq_handler    EDMA1_CH5_DriverIRQHandler
    def_irq_handler    EDMA1_CH6_DriverIRQHandler
    def_irq_handler    EDMA1_CH7_DriverIRQHandler
    def_irq_handler    EDMA1_CH8_DriverIRQHandler
    def_irq_handler    EDMA1_CH9_DriverIRQHandler
    def_irq_handler    EDMA1_CH10_DriverIRQHandler
    def_irq_handler    EDMA1_CH11_DriverIRQHandler
    def_irq_handler    EDMA1_CH12_DriverIRQHandler
    def_irq_handler    EDMA1_CH13_DriverIRQHandler
    def_irq_handler    EDMA1_CH14_DriverIRQHandler
    def_irq_handler    EDMA1_CH15_DriverIRQHandler
    def_irq_handler    GPIO00_DriverIRQHandler
    def_irq_handler    GPIO01_DriverIRQHandler
    def_irq_handler    GPIO10_DriverIRQHandler
    def_irq_handler    GPIO11_DriverIRQHandler
    def_irq_handler    GPIO20_DriverIRQHandler
    def_irq_handler    GPIO21_DriverIRQHandler
    def_irq_handler    GPIO30_DriverIRQHandler
    def_irq_handler    GPIO31_DriverIRQHandler
    def_irq_handler    GPIO40_DriverIRQHandler
    def_irq_handler    GPIO41_DriverIRQHandler
    def_irq_handler    GPIO50_DriverIRQHandler
    def_irq_handler    GPIO51_DriverIRQHandler
    def_irq_handler    GPIO60_DriverIRQHandler
    def_irq_handler    GPIO61_DriverIRQHandler
    def_irq_handler    GPIO70_DriverIRQHandler
    def_irq_handler    GPIO71_DriverIRQHandler
    def_irq_handler    PIN_INT0_DriverIRQHandler
    def_irq_handler    PIN_INT1_DriverIRQHandler
    def_irq_handler    PIN_INT2_DriverIRQHandler
    def_irq_handler    PIN_INT3_DriverIRQHandler
    def_irq_handler    PIN_INT4_DriverIRQHandler
    def_irq_handler    PIN_INT5_DriverIRQHandler
    def_irq_handler    PIN_INT6_DriverIRQHandler
    def_irq_handler    PIN_INT7_DriverIRQHandler
    def_irq_handler    SAI0_DriverIRQHandler
    def_irq_handler    SAI1_DriverIRQHandler
    def_irq_handler    SAI2_DriverIRQHandler
    def_irq_handler    XSPI0_DriverIRQHandler
    def_irq_handler    XSPI1_DriverIRQHandler
    def_irq_handler    XSPI2_DriverIRQHandler
    def_irq_handler    MMU0_DriverIRQHandler
    def_irq_handler    MMU1_DriverIRQHandler
    def_irq_handler    MMU2_DriverIRQHandler
    def_irq_handler    Freqme_DriverIRQHandler
    def_irq_handler    GDET0_DriverIRQHandler
    def_irq_handler    GDET1_DriverIRQHandler
    def_irq_handler    GDET2_DriverIRQHandler
    def_irq_handler    GDET3_DriverIRQHandler
    def_irq_handler    CDOG0_DriverIRQHandler
    def_irq_handler    CDOG1_DriverIRQHandler
    def_irq_handler    CDOG2_DriverIRQHandler
    def_irq_handler    ITRC0_DriverIRQHandler
    def_irq_handler    ELS_DriverIRQHandler
    def_irq_handler    PKC_DriverIRQHandler
    def_irq_handler    OSCCA_DriverIRQHandler
    def_irq_handler    SLEEPCON0_DriverIRQHandler
    def_irq_handler    CPU0_DriverIRQHandler
    def_irq_handler    PMC_DriverIRQHandler
    def_irq_handler    Reserved155_DriverIRQHandler
    def_irq_handler    Reserved156_DriverIRQHandler
    def_irq_handler    NPU_DriverIRQHandler
    def_irq_handler    TRNG_DriverIRQHandler
    def_irq_handler    TEMPDET0_DriverIRQHandler
    def_irq_handler    TEMPDET1_DriverIRQHandler
    def_irq_handler    EZHV_DriverIRQHandler
    def_irq_handler    GLIKEY0_DriverIRQHandler
    def_irq_handler    GLIKEY2_DriverIRQHandler
    def_irq_handler    GLIKEY3_DriverIRQHandler
    def_irq_handler    GLIKEY5_DriverIRQHandler
    def_irq_handler    PVTS0_CPU0_DriverIRQHandler
    def_irq_handler    Reserved167_DriverIRQHandler
    def_irq_handler    PVTS0_HIFI4_DriverIRQHandler
    def_irq_handler    Reserved169_DriverIRQHandler
    def_irq_handler    FRO0_DriverIRQHandler
    def_irq_handler    FRO1_DriverIRQHandler
    def_irq_handler    FRO2_DriverIRQHandler
    def_irq_handler    OCOTP_DriverIRQHandler

    .end
